def z15():
    a=[2,5,123,2,56]
    ch=int(input("введите число: "))
    if ch in a:
        print("Поздравляю, Вы угадали число!")
    else:
        print("Нет такого числа!")
    print (a)
    print(ch)
def z25():
    a = [234,234,5,6,6,6,7,7]
    a2 = []
    count=0
    for i in a:
        if a.count(i) > 1 and i not in a2:
            a2.append(i)
            count+=1
    print(count)

def z35():
    h=[]
    w = []
    a = ('Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскресенье')
    a1 = int(input("Сколько выходных дней на неделе вы хотите? "))
    if a1==1:
        h.append(a[-1])
    if a1==2:
        h.append(a[-2]+" , "+a[-1])
    if a1==3:
        h.append(a[-3]+" , "+a[-2]+" , "+a[-1])
    if a1==4:
        h.append(a[-4]+" , "+a[-3]+" , "+a[-2]+" , "+a[-1])
    if a1==5:
        h.append(a[-5]+" , "+a[-4]+" , "+a[-3]+" , "+a[-2]+" , "+a[-1])
    if a1==6:
        h.append(a[-6]+" , "+a[-5]+" , "+a[-4]+" , "+a[-3]+" , "+a[-2]+" , "+a[-1])
    if a1==7:
        h.append(a[-7]+" , "+a[-6]+" , "+a[-5]+" , "+a[-4]+" , "+a[-3]+" , "+a[-2]+" , "+a[-1])
    if a1==1:
        w.append(a[-7]+" , "+a[-6]+" , "+a[-5]+" , "+a[-4]+" , "+a[-3]+" , "+a[-2])
    if a1==2:
        w.append(a[-7]+" , "+a[-6]+" , "+a[-5]+" , "+a[-4]+" , "+a[-3])
    if a1==3:
        w.append(a[-7]+" , "+a[-6]+" , "+a[-5]+" , "+a[-4])
    if a1==4:
        w.append(a[-7]+" , "+a[-6]+" , "+a[-5])
    if a1==4:
        w.append(a[-7]+" , "+a[-6])
    if a1==4:
        w.append(a[-7] )
    print("Ваши выходные дни: ",' '.join(h))
    print("Ваши рабочие дни: ",' '.join (w))

def z45():
    a=["Петров","Кузнецов","Смирнов","Белов","Соколов","Медведев"]
    a1=["Морозов","Васильев","Соловьёв","Волков","Крылов","Цветков"]
#a
    t = tuple(a[:3] + a1[:3])
    print("Спортивная команда:",' '.join (t))
#b
    print("исходный список команды: ",' '.join (a))
    print("исходный список команды: ", ' '.join (a1))
    print("новый полученный кортеж: ",' '.join (t))
#c
    print("длина =", len(t))
#d
    print("кортеж по алфавиту:",' '.join(sorted(t)))
#e
    if "Иванов" in t:
        print("Студент Иванов входит в спортивную команду.")
    else:
        print("Студент Иванов не входит в спортивную команду.")
    cnt= t.count("Иванов")
    print("Фамилия Иванов встречается",cnt, "раз(а)")
print(z15())
print(z25())
print(z35())
print(z45())