def z16():
    c={"Россия":"Москва","Нидерланды":"Амстердам","Греция":"Афины","Великобритания":"Лондон","Испания":"Мадрид"}
#a
    for key, value in c.items():
        print(f"{key}: {value}")
#b
    key="Россия"
    otv=c.get(key)
    print("столица России:",otv)
#c
    c1=sorted(c.items())
    for key, value in c1:
        print(f"{key}: {value}")
def z26():
    c = {'А': 1, 'В': 1, 'Е': 1, 'И': 1, 'Н': 1, 'О': 1, 'Р': 1, 'С': 1, 'Т': 1, 'Д': 2, 'К': 2, 'Л': 2, 'М': 2, 'П': 2,
         'У': 2, 'Б': 3, 'Г': 3, 'Ё': 3, 'Ь': 3, 'Я': 3, 'Й': 4, 'Ы': 4, 'Ж': 5, 'З': 5, 'Х': 5, 'Ц': 5, 'Ч': 5, 'Ш': 8,
         'Э': 8, 'Ю': 8, 'Ф': 10, 'Щ': 10, 'Ъ': 10}
    w = input("Введите слово(большими буквами): ")
    cnt = 0
    for b in w:
        if b in c:
            cnt += c[b]
    print("Стоимость введенного слова ", w, "=", cnt)
def z36():
    a = {"фамилия": "Белов", "язык": {"английский", "испанский"}}, {"фамилия": "Петров",
                                                                    "язык": {"немецкий", "русский", "китайский"}}, {
        "фамилия": "Кузнецов", "язык": {"китайский", "испанский"}}, {"фамилия": "Смирнов",
                                                                     "язык": {"английский", "русский"}}
    l = set()
    china = []
    for st in a:
        l.update(st["язык"])
        if "китайский" in st["язык"]:
            china.append(st["фамилия"])
    sl = sorted(l)
    print("Языки, которые знают студенты:", ",".join(sl))
    print("Студенты, которые знают китайский язык:", ",".join(china))
print(z16())
print(z26())
print(z36())

